MyHome/src/Catalogs/КошелькиИСчета/КошелькиИСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КошелькиИСчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыКошельковИСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйЛимит</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/CommonModules/КошелькиИСчета/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ТипыКошельковСобственныхСредств() Экспорт
	
	Возврат Перечисления.ТипыКошельковИСчетов.ТипыКошельковСобственныхСредств();
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	Возврат Перечисления.ТипыКошельковИСчетов.ТипыКошельковЗаемныхСредств();
	
КонецФункции

// Используемые кошельки по типу.
// 
// Параметры:
//  ТипыКошельков - ПеречислениеСсылка.ТипыКошельковИСчетов - Типы кошельков
// 
// Возвращаемое значение:
//  Массив - Используемые кошельки по типу
Функция ИспользуемыеКошелькиПоТипу(ТипыКошельков) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Типы", ТипыКошельков);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КошелькиИСчета.Ссылка
	|ИЗ
	|	Справочник.КошелькиИСчета КАК КошелькиИСчета
	|ГДЕ
	|	КошелькиИСчета.ТипСчета В (&Типы)
	|	И КошелькиИСчета.Используется";
	
	МассивКошельков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКошельков;
	
КонецФункции

#КонецОбласти
